USE `seschool_08`;

CREATE TABLE IF NOT EXISTS`Пользователи` (
	`ID_пользователя` BIGINT(8) UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
	`Имя` VARCHAR(200) NOT NULL,
	`Возраст`INT(100) NOT NULL,
	`Страна` VARCHAR(200) NOT NULL
);


CREATE TABLE IF NOT EXISTS `Заказы` (
	`ID_заказа` BIGINT(8) UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
	`ID_пользователя` BIGINT(8) UNSIGNED NOT NULL,
	`Сумма_заказа` INT NOT NULL,
	`Дата_заказа` DATE NOT NULL,
	FOREIGN KEY (`ID_пользователя`) REFERENCES `Пользователи` (`ID_пользователя`)
);


CREATE TABLE IF NOT EXISTS `Отзывы` (
	`ID_Отзыва` BIGINT(8) UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
	`ID_пользователя` BIGINT(8) UNSIGNED NOT NULL,
	`Оценка` INT NOT NULL,
	`Текст_отзыва` VARCHAR(250) NOT NULL DEFAULT 'Все прекрасно',
	FOREIGN KEY (`ID_пользователя`) REFERENCES `Пользователи` (`ID_пользователя`)
);


INSERT INTO `Пользователи` (`Имя`, `Возраст`, `Страна`) VALUES
	('Алексей', 25, 'Россия'),
	('Мария', 30, 'Россия'),
	('Иван', 22, 'Россия'),
	('Елена', 28, 'Россия'),
	('Дмитрий', 35, 'Россия'),
	('Ольга', 27, 'Россия'),
	('Сергей', 31, 'Россия'),
	('Анна', 24, 'Россия'),
	('Павел', 29, 'Россия'),
	('Татьяна', 26, 'Россия'),
	('Анастасия', 32, 'Россия'),
	('Николай', 40, 'Россия'),
	('Ксения', 21, 'Россия'),
	('Виктор', 37, 'Россия'),
	('Светлана', 33, 'Россия');
	
	
INSERT INTO `Заказы` (`ID_пользователя`, `Сумма_заказа`, `Дата_заказа`) VALUES
	(1, 150, '2023-09-01'),
	(2, 200, '2023-09-02'),
	(3, 250, '2023-09-03'),
	(4, 300, '2023-09-04'),
	(5, 350, '2023-09-05'),
	(6, 400, '2023-09-06'),
	(7, 450, '2023-09-07'),
	(8, 500, '2023-09-08'),
	(9, 550, '2023-09-09'),
	(10, 600, '2023-09-10'),
	(11, 650, '2023-09-11'),
	(12, 700, '2023-09-12'),
	(13, 750, '2023-09-13'),
	(14, 800, '2023-09-14'),
	(15, 850, '2023-09-15');
	
INSERT INTO `Отзывы` (`ID_пользователя`, `Оценка`, `Текст_отзыва`) VALUES
	(1, 5, 'Отличный сервис!'),
	(2, 2, 'Хорошие товары.'),
	(3, 5, 'Все понравилось!'),
	(4, 3, 'Сойдет, но есть недочеты.'),
	(5, 5, 'Превосходно!'),
	(6, 1, 'Доволен покупкой.'),
	(7, 5, 'Лучший магазин!'),
	(8, 1, 'Нормально, но можно улучшить.'),
	(9, 5, 'Вернусь снова!'),
	(10, 3, 'Ожидал большего.'),
	(11, 5, 'Все просто замечательно!'),
	(12, 2, 'Хорошая поддержка.'),
	(13, 5, 'Всем рекомендую!'),
	(14, 4, 'Товары качественные.'),
	(15, 1, 'Все сделано на высшем уровне!');


SELECT * FROM `Пользователи`
	JOIN `Заказы` ON `Пользователи`.`ID_пользователя` = `Заказы`.`ID_пользователя`
	JOIN  `Отзывы` ON `Пользователи`.`ID_пользователя` = `Отзывы`.`ID_пользователя`
	WHERE `Оценка` > 4;


SELECT DISTINCT `Пользователи`.`Имя`, `Пользователи`.`Возраст` FROM `Пользователи`
	JOIN `Заказы` ON  `Пользователи`.`ID_пользователя` = `Заказы`.`ID_пользователя`
	WHERE `Заказы`.`Сумма_заказа` > 500;
	
	
SELECT `Заказы`.`ID_заказа`, `Пользователи`.`Имя` FROM `Пользователи`
	JOIN `Заказы` ON `Пользователи`.`ID_пользователя` = `Заказы`.`ID_пользователя`;
	
	
SELECT `Пользователи`.`Имя`,`Пользователи`.`Страна` FROM `Пользователи`
	JOIN `Отзывы` ON `Пользователи`.`ID_пользователя` = `Отзывы`.`ID_пользователя`
	GROUP BY `Отзывы`.`ID_пользователя`
	HAVING COUNT(`Отзывы`.`ID_пользователя`) > 1;
	
	
SELECT `Заказы`.`ID_заказа` FROM `Пользователи`
	JOIN `Заказы` ON `Пользователи`.`ID_пользователя` = `Заказы`.`ID_пользователя`
	JOIN `Отзывы` ON `Пользователи`.`ID_пользователя` = `Отзывы`.`ID_пользователя`
	WHERE `Отзывы`.`Оценка` < 3;

	
SELECT DISTINCT `Пользователи`.`Имя`, `Заказы`.`Дата_заказа`, `Отзывы`.`Текст_отзыва` FROM `Пользователи`
	JOIN `Заказы` ON `Пользователи`.`ID_пользователя` = `Заказы`.`ID_пользователя`
	JOIN `Отзывы` ON `Пользователи`.`ID_пользователя` = `Отзывы`.`ID_пользователя`
	WHERE `Заказы`.`Дата_заказа` > 2024-09-01;
	

SELECT `Пользователи`.`Имя`, AVG(`Заказы`.`Сумма_заказа`) FROM `Пользователи`
	JOIN `Заказы` ON `Пользователи`.`ID_пользователя` = `Заказы`.`ID_пользователя`
	GROUP BY `Пользователи`.`ID_пользователя`
	HAVING COUNT(`Заказы`.`ID_заказа`) >= 1;


SELECT DISTINCT `Пользователи`.`Имя`, `Пользователи`.`Страна`, `Отзывы`.`Оценка` FROM `Пользователи`
	JOIN `Заказы` ON `Пользователи`.`ID_пользователя` = `Заказы`.`ID_пользователя`
	JOIN `Отзывы` ON `Пользователи`.`ID_пользователя` = `Отзывы`.`ID_пользователя`
	WHERE `Отзывы`.`Оценка` > 3;
	

SELECT `Пользователи`.`Имя` FROM `Пользователи`
	JOIN `Отзывы` ON `Пользователи`.`ID_пользователя` = `Отзывы`.`ID_пользователя`
	GROUP BY `Пользователи`.`ID_пользователя`
	HAVING COUNT(`Отзывы`.`ID_Отзыва`) < 1;
	

SELECT DISTINCT `Отзывы`.`Текст_отзыва` FROM `Пользователи`
	JOIN `Отзывы` ON `Пользователи`.`ID_пользователя` = `Отзывы`.`ID_пользователя`
	JOIN `Заказы` ON `Пользователи`.`ID_пользователя` = `Заказы`.`ID_пользователя`
	WHERE `Заказы`.`Сумма_заказа` < 2000;
	